{
    "id": "MustNotIntersectWithLine",
    "name": "Must Not Intersect With",
    "description": [ 
        "<img src=\"@@@_d/mustNotIntersectWithLine2.png\">\n",
        "The rule requires that the entities in the input layer not cross or overlap ",
        "with lines in the coverage layer, if this is not the case the error report is created. ",
        "For this rule there are 2 layers, one is taken as the input layer and the other is the coverage layer. ",
        "The lines of the input layer are taken with a certain tolerance, ",
        "so a buffer is calculated where the radius of this buffer is the tolerance."
    ],
    "actions" : {
        "DeleteLine": {
            "name" : "Delete Line",
            "description": [ 
                "This action deletes line errors. ",
                "This action is useful to delete the entities that do not comply with the rule, ",
                "always taking account of the established tolerance. ",
                "The entities to delete can be selected individually."
            ]
        },
        "MarkLine": {
            "name" : "Mark Line",
            "description": [ 
                "This action makes a new layer with red lines, ",
                "which corresponds to the entities selected in the error report. ",
                "Line errors are created if the lines overlap. ",
                "This action marks the errors in a clear visual way, ",
                "then the user must choose what to do with them. ",
                "The entities to mark can be selected individually."
            ]
        },        
        "MarkPoint": {
            "name" : "Mark Point",
            "description": [ 
                "This action makes a new layer with red points, ",
                "which corresponds to the entities selected in the error report. ",
                "Point errors are created if the lines cross, ",
                "where the points corresponds to the intersections. ",
                "This action marks the errors in a clear visual way, ",
                "then the user must choose what to do with them. ",
                "The entities to mark can be selected individually."
            ]
        }
    }
}